#!/bin/bash

echo "-----------------------------------------------------------------------------"
echo "Ініціалізація GaiaNet з конфігурацією"
echo "-----------------------------------------------------------------------------"

# Ініціалізація GaiaNet з конфігурацією
gaianet init --config https://raw.githubusercontent.com/GaiaNet-AI/node-configs/main/qwen2-0.5b-instruct/config.json

echo "-----------------------------------------------------------------------------"
echo "Запуск ноди"
echo "-----------------------------------------------------------------------------"

# Запуск ноди
gaianet start

echo "-----------------------------------------------------------------------------"
echo "Отримання інформації про ноду (Node ID і Device ID)"
echo "-----------------------------------------------------------------------------"

# Отримання інформації про ноду (Node ID і Device ID)
gaianet info
